Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཡོངས་སུ་དག་པ་ཐམས་ཅད་དུ་འགྲོ་བ་འཐོབ་པ་དང་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་སྟོན་ཏོ། །
en: “I teach them the cause for the arising and attainment of the pure tathāgata’s body that can be anywhere by describing the perfection of good conduct.

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་དང་། སྐུ་མདོག་རྣམ་པར་དག་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱུ་ཡོངས་སུ་སྟོན་ཏོ།
en: “I teach them the cause for the arising and attainment of the tathāgata’s body with its inconceivable, pure color by describing the perfection of patience.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཐུབ་པར་དཀའ་བ་ཡོངས་སུ་སྟོན་ཏོ། །
en: I teach them the cause for the arising and attainment of the tathāgata’s invincible body by describing the perfection of diligence.

source: བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཟིལ་གྱིས་གནོན་ལ། ཟིལ་གྱིས་གནོན་པ་རྣམ་པར་དག་པ་ཡོངས་སུ་སྟོན་ཏོ། །
en: “I teach them the cause for the arising and attainment of the tathāgata’s pure body, which is unsurpassable and overwhelming, by describing the perfection of meditation.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་ཆོས་ཀྱི་སྐུ་ཡོངས་སུ་དག་པ་ཡོངས་སུ་སྟོན་ཏོ། །
en: “I teach the pure Dharma body by describing the perfection of wisdom.

source: ཐབས་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་འགྲོ་བ་ཐམས་ཅད་ལ་མངོན་དུ་གྱུར་པའི་སྐུ་གཙང་ཞིང་རྣམ་པར་དག་པ་ཡོངས་སུ་སྟོན་ཏོ། །
en: “I teach the pure and pristine body manifesting to all beings by describing the perfection of skillful method.

source: སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་བསྐལ་པ་ཐམས་ཅད་ཀྱི་དུས་སུ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་དང་འགྲོགས་པའི་སྐུ་རྣམ་པར་དག་པ་ཡོངས་སུ་སྟོན་ཏོ། །
en: “I teach the pure body that accompanies the minds of beings during all kalpas by describing the perfection of prayer.

source: སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་མངོན་པར་འབྱུང་བའི་སྐུ་རྣམ་པར་དག་པ་ཡོངས་སུ་སྟོན་ཏོ། །
en: “I teach the pure bodies that arise in all buddha realms by describing the perfection of strength.

source: ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་འགྲོ་བ་ཐམས་ཅད་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཚིམ་པར་མཛད་པའི་སྐུ་རྣམ་པར་དག་པ་ཡོངས་སུ་སྟོན་ཏོ། །
en: “I teach the pure bodies that satisfy all beings in accordance with their wishes by describing the perfection of knowledge.

source: མྱི་དགེ་བའི་ཆོས་ཐམས་ཅད་ལས་རྣམ་པར་ལྡོག་པ་ཡོངས་སུ་བརྗོད་ཅིང་བལྟ་ན་ཕུལ་དུ་བཟང་བའི་སྐུ་རྣམ་པར་དག་པ་ཡོངས་སུ་སྟོན་ཏོ། །
en: “I teach the pure body that is the highest goodness by describing the rejection of all bad qualities.

source: དེ་ལྟར་དེ་དག་ཆོས་ཀྱི་སྦྱིན་པས་ཡོངས་སུ་བསྡུས་ཏེ།
en: “In that way, those comprise the generosity of giving the Dharma.

source: ནོར་དང་རིན་པོ་ཆེ་མཐའ་ཡས་པའི་ཚོགས་ཀྱིས་ཉེ་བར་བརྟན་པ་བྱས་ཤིང་སོ་སོར་འགྱེད་དོ། །ཡང་རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་སྤོས་དང་།
en: I also support them by distributing an accumulation of endless wealth and jewels.

source: བདུག་སྤོས་དང་། བསྒོ་བ་དང་། བསྐུ་བ་སྦྱོར་ཤེས་ཏེ། འདི་ལྟར་སྤོས་ཀྱི་རྒྱལ་པོ་གཞལ་དུ་མེད་པ་ལ་སྩོགས་པ་དང་། སྤོས་ཀྱི་རྒྱལ་པོ་སིནྡུ་བ་ར་ལ་སྩོགས་པ་དང་། སྤོས་ཀྱི་རྒྱལ་པོ་མི་ཕམ་པ་ལ་སྩོགས་པ་དང་། སྤོས་ཀྱི་རྒྱལ་པོ་རྣམ་པར་གསལ་བྱེད་ལ་སྩོགས་པ་དང་། སྤོས་ཀྱི་རྒྱལ་པོ་ཉི་མ་ཡོད་པ་ལ་སྩོགས་པ་དང་།
en: “Noble one, I also know about all perfumes, incenses, aromas, infusions, ointments, and their combinations.

source: སྤོས་ཀྱི་རྒྱལ་པོ་དུས་དང་འཐུན་པ་ལ་སྩོགས་པ་དང་། སྤོས་ཀྱི་རྒྱལ་པོ་སྦྲུལ་གྱི་སྙིང་པོའི་ཙན་དན་ལ་སྩོགས་པ་དང་། སྤོས་ཀྱི་རྒྱལ་པོ་སྤྲིན་གྱི་ཨ་ག་རུ་ལ་སྩོགས་པ་དང་། སྤོས་ཀྱི་རྒྱལ་པོ་དབང་པོ་མི་འཁྲུག་པ་ལ་སྩོགས་པ། སྤོས་སྦྱར་བ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: “In that way, I know all combinations of perfumes: kings of perfumes such as sesame, kings of perfumes such as chaste tree, kings of perfumes such as ajivāti, kings of perfumes such as vibodhana, kings of perfumes such as aruṇavati, kings of perfumes such as yellow sandalwood, kings of perfumes such as uragasāra sandalwood, kings of perfumes such as cloud agarwood, and kings of perfumes such as akṣobhyendriya.

source: ཡང་རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱེད་པ་དང་། སྒོ་ཐམས་ཅད་ནས་སངས་རྒྱས་བལྟ་ཞིང་མཆོད་པ་དང་། བསྙེན་བཀུར་བའི་སྤོས་ཀྱི་གཟུགས་ཤེས་ཏེ།
en: “Also, noble one, I know the kind of perfume that will satisfy all beings and through which one sees, makes offering to, and honors the buddhas anywhere.

source: རིགས་ཀྱི་བུ། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱེད་པ་དང་། སྒོ་ཐམས་ཅད་ནས་སངས་རྒྱས་བལྟ་ཞིང་མཆོད་པ་དང་། བསྙེན་བཀུར་བའི་སྤོས་ཀྱི་གཟུགས་འདིས་ཁོ་བོའི་བསམ་པ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: “Noble one, through this kind of perfume that will satisfy all beings and through which one sees, makes offering to, and honors the buddhas anywhere, all of my wishes are fulfilled.

source: དེའི་མཐུས་ཁོ་བོ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པའི་རྒྱན་གྱི་སྤྲིན་བྱིན་གྱིས་རློབ་པ་བྱེད་དེ་འདི་ལྟར་སྤོས་ཀྱི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་གྱི་རྒྱན་ནས་རྣམ་པ་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བའི་རྒྱན་གྱི་སྤྲིན་གྱི་བར་དུ་བྱིན་གྱིས་རློབ་པ་བྱེད་དོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ན་ནི་མ་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱ་བར་འདོད་པར་གྱུར་པ་དེའི་ཚེ།
en: Through its power I manifest clouds of adornments that will protect all beings.

source: ཁོ་བོས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱེད་པ་དང་། སྒོ་ཐམས་ཅད་ནས་སངས་རྒྱས་བལྟ་ཞིང་མཆོད་པ་དང་། བསྙེན་བཀུར་བའི་སྤོས་ཀྱི་གཟུགས་འདི་ལས་སྤོས་ཀྱི་མཛོད་ཀྱི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་ཚད་གཟུང་དུ་མྱེད་པ་བཏོན་ཅིང་།
en: In that way, I manifest clouds of perfume that form aerial palaces and so on, up to clouds of adornments that venerate and make offerings to all the tathāgatas.

source: ཕྱོགས་བཅུའི་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ན་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་སྤོས་ཐམས་ཅད་ཀྱི་མཛོད་ཀྱི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་གྱི་རྒྱན་བྱིན་གྱིས་རློབ་པ་བྱེད་དོ། །ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་སྦྱོང་བའི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་ཁང་པའི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་ར་བའི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་བ་གམ་གྱི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་རྟ་བབས་ཀྱི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་སྐར་ཁུང་གི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་པུ་ཤུའི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་ཟླ་གམ་གྱི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་གདུགས་ཀྱི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་རྒྱལ་མཚན་བསྒྲེང་བའི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་ལྷའི་བ་དན་གྱི་སྤྲིན་གྱི་རྒྱན་དང་།
en: “Thus, noble one, when I wish to make offerings to the tathāgatas, then from this form of perfume that will satisfy all beings and through which one sees, makes offering to, and honors the buddhas anywhere, I manifest clouds of perfume that form countless kūṭāgāras, and throughout the realm of phenomena I manifest clouds of perfume in the form of kūṭāgāras that adorn the assemblies of the followers of the tathāgatas present throughout the realm of phenomena in the ten directions.

source: སྤོས་ཀྱི་བླ་བྲེའི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་གཟུགས་ཀྱི་དྲ་བའི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་འོད་ཀྱི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་སྣང་བ་དྲི་མ་མྱེད་པའི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་བྱིན་གྱིས་རློབ་སྟེ།
en: “All the pure buddha realms become adorned by clouds, an adornment of clouds as palaces of perfume, an adornment of clouds as walls of perfume, an adornment of clouds as ornamental roofs of perfume, an adornment of clouds as toraṇas of perfume, an adornment of clouds as windows of perfume, an adornment of clouds as balconies of perfume, an adornment of clouds as a crescent moon of perfume, an adornment of clouds as parasols of perfume, an adornment of clouds as erected banners of perfume, an adornment of clouds as flags of perfume, an adornment of clouds as canopies of perfume, an adornment of clouds as nets of strings of beads of perfume, an adornment of clouds as lights of perfume, an adornment of clouds as a display of the stainless radiances of perfume, and an adornment of rain from clouds of all perfume.

source: རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱེད་པ་དང་། སྒོ་ཐམས་ཅད་ནས་སངས་རྒྱས་བལྟ་ཞིང་མཆོད་པ་དང་། བསྙེན་བཀུར་བའི་སྤོས་ཀྱི་གཟུགས་ཀྱི་ཆོས་ཀྱི་སྒོ་འདི་ཤེས་པར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་སྨན་གྱི་རྒྱལ་པོ་ལྟ་བུར་གྱུར་པ། བལྟ་ན་དོན་ཡོད་པ། འགྲོགས་ན་དོན་ཡོད་པ། རྗེས་སུ་དྲན་ན་དོན་ཡོད་པ། བརྟུལ་ཞུགས་རྗེས་སུ་བྱས་ན་དོན་ཡོད་པ། མྱིང་ཐོས་ན་དོན་ཡོད་པ། མཐོང་པ་ཙམ་གྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་ཞི་བར་འགྱུར་བ། མཐོང་བ་ཙམ་གྱིས་སེམས་ཅན་རྣམས་ངན་སོང་གི་རྒྱུད་ལས་ལྡོག་པར་འགྱུར་བ།
en: “Noble one, I know only this Dharma gateway called the forms of perfume that satisfy all beings and through which in every way one sees, makes offerings to, and honors the buddhas.

source: མཐོང་པ་ཙམ་གྱིས་སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཆོས་ལ་སྐབས་ཕྱེ་བ་ཐོབ་པར་གྱུར་པ། མཐོང་བ་ཙམ་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཐམས་ཅད་ཞི་བར་འགྱུར་བ་མཐོང་ཙམ་གྱིས་སེམས་ཅན་ཐམས་ཅད་འཇིགས་པ་དང་། འཁོར་བའི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་ཀྱི་འཇིགས་པ་དང་བྲལ་བར་འགྱུར་བ་མཐོང་བ་ཙམ་གྱིས་སེམས་ཅན་རྣམས་ཐམས་ཅད་མཁྱེན་པའི་ཕྱོགས་ལ་རྟེན་པར་འགྱུར་བའི་ཕྱིར་མྱི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ། མཐོང་བ་ཙམ་གྱིས་སེམས་ཅན་རྣམས་རྒ་ཤིའི་གྲོག་པོ་དང་གཡང་སར་མི་ལྟུང་བ། མཐོང་བ་ཙམ་གྱིས་སེམས་ཅན་རྣམས་ཆོས་ཀྱི་དབྱིངས་མཉམ་པ་ཉིད་ལ་གནས་པས་མྱ་ངན་ལས་འདས་པའི་བདེ་བ་འཐོབ་པར་འགྱུར་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ་ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །
en: How could I know the conduct or describe the qualities of the bodhisattvas who are like kings of medicine, who are beneficial to see, who are beneficial to be with, who are beneficial to think of, whose self-discipline is beneficial to follow, whose names are beneficial to hear, the mere sight of whom causes the kleśas of all beings to cease, the mere sight of whom causes beings to turn away from the existences in the lower realms, the mere sight of whom causes all beings to gain the opportunity to receive the Buddhadharma, the mere sight of whom causes the mass of suffering of beings to end, the mere sight of whom causes all beings to be free of the fear of all the existences in saṃsāra, the mere sight of whom causes all beings to be resolute in going in the direction of omniscience and therefore attain fearlessness, the mere sight of whom causes beings not to fall into the crevasse or chasm of old age and death, and the mere sight of whom causes beings to rest in the equality of the realm of phenomena and therefore attain the bliss of nirvāṇa?

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་ཏ་ལའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Depart, noble one. In this southern region there is a town called Tāladhvaja.

source: དེ་ན་རྒྱལ་པོ་མེ་ཞེས་བྱ་བ་འདུག་གིས།
en: There dwells a king by the name of Anala.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས། ཚོང་དཔོན་སྤོས་འཚོང་ཀུན་ཏུ་བལྟ་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཚོང་དཔོན་སྤོས་འཚོང་ཀུན་ཏུ་བལྟ་བ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། ཚོང་དཔོན་སྤོས་འཚོང་ཀུན་ཏུ་བལྟ་བའི་དྲུང་ནས་སོང་ངོ་། །
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the perfume-seller head merchant Samanta­netra, circumambulated the perfume-seller head merchant Samanta­netra many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the perfume-seller head merchant Samanta­netra.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དེ་དག་རྗེས་སུ་དྲན་པར་བྱེད་ཅིང་།
en: Anala Chapter 20 Sudhana, the head merchant’s son, remembered the succession of his kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་གི་སྒོ་དེ་དག་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་།
en: He thought about the gateways of their instructions.

source: བདག་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་ངོ་། །ཞེས་རང་གི་སེམས་ཡོངས་སུ་ཚིམ་པར་བྱ་བ་དང་།
en: He was content in his mind, thinking, “I have been accepted as a pupil by the kalyāṇamitras.”

source: བདག་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བསྲུངས་པས། ང་ནི་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་ལྡོག་པར་ཡང་མྱི་འགྱུར་རོ། །སྙམ་དུ་རྣམ་པར་སེམས་ཤིང་། སེམས་དགའ་བ་ནི་རབ་ཏུ་ཐོབ།
en: He observed in his mind, “I am under the protection of the kalyāṇamitras, and I will never regress in my progress toward the highest, complete enlightenment.”

source: སེམས་དང་བ་དང་སེམས་རབ་ཏུ་དགའ་བ་དང་། སེམས་རངས་པ་དང་། སེམས་མགུ་བ་དང་། སེམས་མོས་པ་དང་། སེམས་ཀྱི་ཤུགས་དང་། སེམས་རྣམ་པར་ཞི་བ་དང་། སེམས་རྒྱ་ཆེན་པོ་དང་། སེམས་ཀྱི་རྒྱན་དང་། སེམས་ལ་ཐོགས་པ་མྱེད་པ་དང་སེམས་ལ་སྒྲིབ་པ་མྱེད་པ་དང་། སེམས་རྣམ་པར་ཕྱེ་བ་དང་། སེམས་ཡང་དག་པར་གཞོལ་བ་དང་། སེམས་ཀྱི་དབང་དང་། སེམས་དབང་སྒྱུར་བ་དང་། སེམས་ཀྱི་ཆོས་ཁོང་དུ་ཆུད་པ་དང་། སེམས་ཀྱིས་ཞིང་རྒྱས་བར་དགང་བ་དང་། སེམས་སངས་རྒྱས་མཐོང་བས་བརྒྱན་པ་དང་། སེམས་སྟོབས་བཅུའི་ཡིད་ལ་བྱ་བ་དང་མི་འབྲལ་བའང་ཐོབ་ནས།
en: Thinking this, his mind was happy, his mind was serene, his mind was pleased, his mind was gladdened, his mind was delighted, his mind was joyful, his mind was strong, his mind was soothed, his mind was vast, his mind was adorned, his mind was unimpeded, his mind was unobscured, his mind was clear, his mind was composed, his mind had power, his mind had supremacy, his mind comprehended the Dharma, his mind pervaded the realms, his mind was adorned by the vision of the buddhas, and his mind never stopped focusing on the ten strengths.

source: དེ་མཐར་ཀྱིས་ལྗོངས་ནས་ལྗོངས་དང་། གྲོང་ནས་གྲོང་དང་། ཡུལ་ནས་ཡུལ་དུ་ཚོལ་ཞིང་གྲོང་ཁྱེར་ཏ་ལའི་རྒྱལ་མཚན་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: Sudhana went from land to land, town to town, district to district, and eventually he reached the town of Tāladhvaja.

source: རྒྱལ་པོ་མེ་གང་ན་བཞུགས་ཞེས་དྲིས་ན།
en: He asked, “Where is King Anala?”

source: དེ་ལ་འགྲོ་བ་གཞན་དག་གིས་འདི་སྐད་དུ་བསྟན་ཏེ། རིགས་ཀྱི་བུ་འདེ་རེ་རྒྱལ་པོ་མེ་ནི་རྒྱལ་པོའི་དོན་བསྒྲུབ་པའི་ཕྱིར་སེང་གེའི་གདན་ལ་བཞུགས་ཤིང་། རྒྱལ་པོའི་ཕྲིན་ལས་མཛད་དོ། །
en: People told him, “Noble one, King Anala sits on the lion throne here performing the activities of a king in order to accomplish the duties of a king.

source: ཁམས་རབ་ཏུ་སྐྱོང་ངོ་། །
en: He rules the realm.

source: ཆད་པས་གཅད་པར་འོས་པ་ནི་ཆད་པས་གཅོད་དོ།
en: He penalizes those who deserve to be penalized.

source: བྱ་དགས་སྡུད་པར་འོས་པ་ནི་བྱ་དགས་སྡུད་དོ།
en: He favors those who should be favored.

source: གཡོན་ཡོད་པ་རྣམས་ལ་ནི་གྱོད་རྨེད་དོ། །
en: He condemns criminals to punishment.

source: རྩོད་པ་རྣམས་ཀྱི་ཞལ་ཅེ་ནི་ཡོངས་སུ་གཅོད་དོ། །
en: He makes the decisions on legal disputes.

source: དམའ་བ་རྣམས་ནི་དབུགས་འབྱིན་ཏོ། །
en: He brings relief to those who are low.

source: དྲེགས་པ་རྣམས་ནི་འདུལ་བ་མཛད་དོ། །
en: He humbles the arrogant.

source: སྲོག་གཅོད་པ་ལས་ནི་རྣམ་པར་ཟློག་གོ །
en: He turns the people away from killing.

source: མ་བྱིན་པར་ལེན་པ་དང་ནི་རྣམ་པར་འབྱེད་པ་མཛད་དོ། །
en: He dissuades them from theft.

source: གཞན་གྱིས་ཡོངས་སུ་བཟུང་བ་ལ་མངོན་པར་ཞེན་པ་ནི་རྣམ་པར་ཞི་བར་མཛད་དོ། །
en: He causes them to cease yearning for those who belong to others.

source: བརྫུན་དུ་སྨྲ་བ་ལས་ནི་ཕྱིར་ཟློག་པ་མཛད་དོ། །
en: He makes them turn away from lying.

source: ཕྲ་མའི་ཚིག་དང་ནི་རྣམ་པར་འབྲལ་བར་མཛད་དོ། །
en: He makes them desist from slander.

source: ཞེ་གཅོད་པའི་ངག་ནི་རྒྱུན་གཅོད་པ་མཛད་དོ། །
en: He makes them cease speaking harshly.

source: ཚིག་ཀྱལ་པ་ལས་ནི་ཡོངས་སུ་གློན་ནོ། །
en: He makes them avoid idle talk.

source: ཆགས་སེམས་དང་ནི་མྱི་འདྲེ་བ་མཛད་དོ། །
en: He causes their minds to be free from craving.

source: གནོད་སེམས་དང་ནི་རྒྱང་སྲིང་ངོ་། །
en: He makes them dispel malice.

source: ལོག་པར་ལྟ་བ་དང་ནི་འདྲེ་བ་མྱེད་པར་མཛད་དོ། །
en: He makes them disengage from false views.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་རྒྱལ་པོ་མེ་གང་ན་བ་དེར་ཕྱིན་ན།
en: Then Sudhana, the head merchant’s son, went to where King Anala was.

source: དེས་མཐོང་བ། རྒྱལ་པོ་མེ་དེ་ནི་རིན་པོ་ཆེའི་སེང་གེའི་ཁྲི་ཆེན་པོ་རྡོ་རྗེ་མཐུ་བོ་ཆེའི་ནོར་བུ་སྣ་ཚོགས་ཀྱིས་སྨྲས་པ།
en: He saw King Anala seated on a great lion throne that was beautified by various powerful diamond jewels.

source: རིན་པོ་ཆེ་འོད་གསལ་བ་རྣམ་པ་སྣ་ཚོགས་གྲངས་མྱེད་པ་ལས་བྱས་པའི་རྐང་པ་བཀྱེ་བ།
en: It had legs that shone with countless and various kinds of jewels.

source: རིན་པོ་ཆེ་གཅིག་མ་ཡིན་པས་ལེགས་པར་སྤྲས་ཤིང་བརྒྱན་པས་ཡིད་དུ་འོང་བའི་ལྷུན་དང་ལྡན་པ།
en: It had a beautiful form adorned and beautified by numerous jewels.

source: གསེར་གྱི་ལྕག་པོད་ཀྱི་དྲ་བས་ལེགས་པར་བླས་ཤིང་ཆུབ་པར་བཏགས་པ།
en: It was perfectly covered with a network of gold threads.

source: ནོར་བུ་རིན་པོ་ཆེ་དུ་མའི་སྒྲོན་མེས་ཤིན་ཏུ་སྣང་བར་བྱས་པ།
en: It was illuminated by numerous precious lamps.

source: ནོར་བུ་རིན་པོ་ཆ་དབང་གི་རྒྱལ་པོ་ལས་བྱས་པའི་པད་མོའི་སྙིང་པོ་ཅན།
en: It had a center of lotuses made from the precious jewels called the king of power.

source: ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་སྟན་རིམ་པ་དུ་མར་བཏིང་བ།
en: It had many layers of beautiful cushions made of precious divine materials.

source: གམ་ཡོ་ནས་ལྷ་རྫས་ཀྱི་སྤོས་སྣ་ཚོགས་ཀྱི་བདུག་སྤོས་ཀྱིས་ཤིན་ཏུ་བདུགས་པ།
en: It was perfumed by the aroma of the various divine incenses arranged around it.

source: རིན་པོ་ཆེའི་རྒྱལ་མཚན་བསྒྲེང་བ། བརྒྱ་ཕྲག་སྟོང་གིས་མཛེས་པར་བྱས་པ།
en: It was made magnificent by a hundred thousand erected precious banners.

source: རིན་པོ་ཆེའི་བ་དན་བརྒྱ་ཕྲག་སྟོང་རྣམ་པར་བྲེས་པས་བརྒྱན་པ།
en: It was beautified by a hundred thousand raised precious flags.

source: རིན་པོ་ཆེའི་མེ་ཏོག་གི་ཆུན་པོ་སྣ་ཚོགས་ཀྱི་ལྡ་ལྡི་རབ་ཏུ་བཀྱེ་བས་ཤིན་ཏུ་མཛེས་པར་བྱས་པ།
en: It was beautified by arrangements of clusters of precious flowers.

source: སྟེང་ནས་ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་བླ་རེ་སྣ་ཚོགས་བྲེས་པ་ཞིག་ལ་འདུག་ཅིང་།
en: It was covered from above by various canopies made of precious divine materials.

source: དེ་ནི་གཞོན་ཞིང་དར་ལ་བབ་པ།
en: King Anala was a youth who had reached adulthood.

source: གཟུགས་མཛེས་ཤིང་བལྟ་ན་ཡིད་དུ་འོང་བ།
en: He was handsome and attractive.

source: མགོ་གདུགས་ལྟར་འདུག་པ་གཙུག་ཏོར་གྱི་སྤྱི་བོ་ཅན། འཕྲལ་བ་ཡངས་པ།
en: His head was like a parasol, with an uṣṇīṣa on the crown of his head.

source: མྱིག་དཀར་ནག་འབྱེས་ཤིང་རིང་ལ།
en: He had a broad forehead and wide, deep black eyes.

source: སྣའི་དབྱིབས་ལེགས་ཤིང་བཟང་ལ་རན་པར་མཛེས་པ་དང་ལྡན་པ།
en: His nose was lovely, high and prominent.

source: མཆུ་མཚལ་ལྟར་མདོག་བཟང་ཞིང་ཤིན་ཏུ་ལེགས་པ་དང་ལྡན་པ།
en: His lips were the beautiful color of vermilion and perfectly proportioned.

source: སོ་མཉམ་ཞིང་ཐགས་བཟང་ལ་ཤིན་ཏུ་དཀར་བ་བཞི་བཅུ་ཚང་བ་དང་ལྡན་པ།
en: His teeth were even, without gaps, very white, and a full forty in number.

source: འགྲམ་པའི་ལྷ་ང་སེང་གེའི་འགྲམ་པ་ལྟར་འདུག་པ་ཁུར་བ་ཤས་རྒྱས་པ།
en: He had jaws like a lion. His cheeks were full and wide.

source: སྨིན་ཚུགས་གཞུ་ལྟར་འདུག་ཅིང་རིང་ལ་ཤིན་ཏུ་མཛེས་པ།
en: His eyebrows were long, beautiful, and curved like a bow.

source: རྣ་བའི་ཤལ་རིང་ཞིང་ལྷོད་པར་འཕྱང་བ།
en: His earlobes were long and hung loosely.

source: སྙིང་ཀ་དཔལ་གྱི་བེ་འུས་བརྒྱན་པ།
en: His heart area was adorned by the śrīvatsa.

source: ཐལ་གོང་ཤིན་ཏུ་རྒྱས་ལ།
en: The flesh between his shoulder blades was muscular.

source: དཔུང་མགོའི་ལྷུན་ལེགས་ཤིང་ཟླུམ་པ།
en: His shoulders were bulky and rounded.

source: ལག་པ་རིང་བ་དྲ་བར་འབྲེལ་བའི་སོར་མོ་ཅན།
en: His arms were long. His fingers were webbed.

source: རྐང་ལག་འཁོར་ལོས་བརྒྱན་པ།
en: His hands and feet were adorned by wheels.

source: རྐང་ལག་འཇམ་ཞིང་གཞོན་ལ་ཤས་རྒྱས་པ།
en: His hands and feet were soft, young, and thick.

source: འོད་འདོམ་གང་བ་དང་ལྡན་པ་མདོག་གསེར་གྱི་ཁ་དོག་ལྟར་འདུག་པ།
en: He had a halo a fathom in width. He was golden in color.

source: མགོ་ལ་ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་ཅོད་པན་ཐོགས་པ།
en: He wore a precious wish-fulfilling jewel as his topknot crest.

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་ལས་བྱས་པའི་འབྲལ་བའི་རྒྱན་ཟླ་གམ་གྱིས་མཛེས་པར་བརྒྱན་པ།
en: His forehead was adorned by the adornment of a crescent moon made from Jambu River gold.

source: རྣ་བ་ལས་རིན་པོ་ཆེ་ཨིན་དྲ་ནཱི་ལའི་རྣ་ཆ་དྲི་མ་མེད་པ་འཕྱང་བ། ནོར་བུ་རིན་པོ་ཆེ་རིན་ཐང་མྱེད་པའི་སེ་མོ་དེའི་འོད་ཀྱིས་སྣང་བར་བྱས་པས།
en: Stainless sapphire jewel earrings hung from his ears.

source: དྲི་མ་མྱེད་པའི་རོ་སྟོད་རྒྱས་པ་དང་ལྡན་པ།
en: He had a wide, stainless upper body.

source: ལྷ་རྫས་ཀྱི་ནོར་བུ་དམ་པའི་དཔུང་རྒྱན་དང་། གདུ་བུས་ལག་པ་མཛེས་པར་བརྒྱན་པ་ཞིག་སྟེ། རིན་པོ་ཆེའི་གདུགས་ཆེན་པོ་རིན་པོ་ཆེ་བཻཌཱུརྱ་དྲི་མ་མྱེད་པའི་ཡུ་བ་ཅན། རིན་པོ་ཆེའི་ཤར་བུ་བརྒྱ་ཕྲག་བཅུས་རྣམ་པར་ཕྱེ་བ།
en: His arms were beautified by armlets and bracelets made of sublime divine jewels.

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་བླ་གབ་ཅན་ནོར་བུ་རིན་པོ་ཆེ་སྒྲ་སྣང་བ་རྣམ་པར་དག་པའི་སྙིང་པོ་ཅན། རིན་པོ་ཆེའི་དྲིལ་བུའི་ཕྲེང་བ་ལས་སྒྲ་སྙན་ཅིང་། ཡིད་དུ་འོང་བ་འབྱུང་བ། ནོར་བུ་རིན་པོ་ཆེའི་འོད་ཕྱོགས་ཀུན་ཏུ་འཕྲོ་བ་ཅན་དྲུང་ནས་བཟུང་ཞིང་བསྒྲེང་བ།
en: Held above him was a precious great parasol with a stainless precious handle of beryl; with a covering made of Jambu River gold; with a pure, large, precious asteria jewel in the center; and with a string of precious little bells from which came sweet, pleasant sounds; the light from its precious jewels shone in all directions.

source: རྒྱལ་པོའི་གཟི་བརྗིད་དང་དབང་ཆེན་པོ་ལ་གནས་པ། སྲིད་ལ་གཞན་གྱི་འཁོར་གྱིས་གཙེ་བ་མེད་པ།
en: He had attained the majesty and sovereignty of a king who could not be harmed by enemy armies.

source: དགྲའི་འཇིགས་པ་དང་བྲལ་བའི་དབང་ཕྱུག་དང་ལྡན་པར་འདུག་པ་མཐོང་ངོ་། །
en: He had such power that he had no fear of enemy armies.

source: དེའི་འཁོར་ཀུན་ནས་ཀྱང་བློན་པོ་སྟོང་ཕྲག་བཅུ་ཚོགས་ཤིང་རྒྱལ་པོའི་དགོས་པ་བསྒྲུབ་པ་ལ་བརྩོན་པ་མཐོང་ངོ་། །
en: He had an entourage of ten thousand ministers dedicated to accomplishing whatever the king required. Sudhana saw that in front of King Anala there were those who carried out his punishments.

source: དེའི་མདུན་ན་ཆད་པས་གཅོད་པའི་མྱི་སེམས་ཅན་དམྱལ་བའི་སྲུངས་མ་ལྟ་བུ།
en: They resembled the guardians in the hells.

source: གཤིན་རྗེའི་གཡོག་འཁོར་ལྟ་བུ་འཇིགས་འཇིགས་ལྟའི་གོས་གྱོན་པ།
en: They wore terrifying clothing like the servants of Yama.

source: གཏུམ་ཞིང་མྱི་བཟད་ལ་འཇིགས་པ་ཆེན་པོ་བསྐྱེད་པ་མྱིག་དམར་བ་སོ་གཙིགས་པ།
en: They were ferocious, horrible, and greatly terrifying. Their eyes were red, and they were biting their lower lips.

source: གདོང་གི་གཉེར་མ་གསུམ་ཁྲོ་གཉེར་དུ་བསྡུས་པ། རལ་གྱི་དང་།
en: Their faces had the threefold lines of frowning wrathfully.

source: སྟ་རེ་དང་། ལྕགས་ཀྱི་ཆང་མདུད་དང་། མདའ་དང་། བེ་རྒ་དང་། མདུང་ལ་སྩོགས་པའི་མཚོན་ཆ་དང་།
en: They were holding weapons and tools such as swords, axes, spears, short spears, clubs, long spears, and so on.

source: ལག་ཆ་ཐོགས་པའི་ལུས་དང་། བཞིན་གྱི་དབྱིབས་མྱི་སྡུག་ཅིང་འཇིགས་སུ་རུང་བ། སྤྲིན་ནག་པོ་ལྟར་འདུག་པ།
en: They had ugly, terrifying faces.

source: མྱི་སྙན་ཅིང་བརླང་ལ་བསྔངས་པའི་སྒྲ་དྲག་པོ་འབྱིན་པ། གཟི་ལྟ་བར་དཀའ་བ། འཇིགས་པ་ཆེན་པོ་བསྐྱེད་པ། སྲོག་ཆགས་བརྒྱ་ཕྲག་སྟོང་གི་སྙིང་འགེམས་པར་བྱེད་པ། དེ་ལྟ་བུ་དག་ཆད་པས་གཅད་པར་འོས་པའི་སེམས་ཅན་ཆད་པས་གཅོད་པ་ལ་བརྩོན་པ་མཐོང་ངོ་། །དེ་ན་སྲོག་ཆགས་རྐུ་བ་གཞན་གྱི་ནོར་ལ་འཕྲོག་པ། སེམས་ཅན་གྱི་ལོངས་སྤྱོད་ཆུད་གསོན་པ། ལམ་སྒུགས་ཤིང་འཕྲོག་པ། གྲོང་དང་གྲོང་ཁྱེར་དང་།
en: They were like a black cloud, emitting horrible, dreadful shouts of rage, unbearable to look at, inspiring great terror, and bringing fear into the hearts of a hundred thousand beings, and they were dedicated to punishing those deserving of punishment.

source: གྲོང་རྡལ་དང་། ལྷས་ལ་མྱེས་གཏོང་བ།
en: He saw many hundreds of thousands of individuals who had committed various crimes, each bound tightly with five ropes, brought before King Anala.

source: གྲོང་དུ་ཆོམ་པོ་བྱེད་པ། ཁྱིམ་ཕུགས་འདེབས་པ། སྡིག་སྡིག་ལྟར་བྱེད་པ། དུག་ལྡུད་པ། དཀྲུགས་མ་བྱེད་པ། ཐོང་མི་བྱེད་པ། བྱི་བོ་བྱེད་པ། ལོག་པར་ཞུགས་པ།
en: There were thieves; those who had seized others’ property; those who had destroyed the property of others; those who had robbed travelers; those who had burned down villages, towns, and markets; those who had slain families; those who were burglars; those who had injured; those who had poisoned; those who had rioted; those who had murdered; those who had seduced the wives of others; those with a bad way of life; those with evil intentions; and those who were covetous.

source: གནོད་པར་སེམས་པ། འདོད་ཆེན་ཆེ་བ། སྡིག་པ་སྣ་ཚོགས་ཀྱི་ལས་མྱི་བཟད་པ་བྱེད་པ། བརྒྱ་སྟོང་མང་པོ་བཅིང་བ་དམ་པོ་ལྔས་བཅིངས་ཤིང་རྒྱལ་པོ་མྱེའི་དྲུང་དུ་ཁྲིད་པ་དག་ཀྱང་མཐོང་ངོ་། །དེ་དག་ལའང་རྒྱལ་པོ་མྱེས་ཅི་རིགས་བར་ཆད་པས་གཅད་པར་གྱུར་པ་མཐོང་ངོ་། །
en: Sudhana saw King Anala have them punished in various ways.
